In [1]:
import mysql.connector
from mysql.connector import Error
import pandas as pd

In [14]:
def create_server_conn(host_name, username, user_pw):
    connection = None
    try:
        connection = mysql.connector.connect(
            host = host_name,
            user = username,
            password = user_pw
        )
        print('MySQL database connection successfull!')
    except Error as err:
        print(f'Error: "{err}"')
    return connection

pw = 'sSaAlLiIkK7869'
db = 'MySQL_Python'
connection = create_server_conn('localhost', 'root', pw)

MySQL database connection successfull!

In [15]:
# Create MySQL_Python Database

def create_database(connection, query):
    cursor = connection.cursor()
    try:
        cursor.execute(query)
        print('Database created successfully!')
    except Error as err:
        print(f'Error: "{err}"')

create_database_query = 'Create Database MySQL_Python'

create_database(connection, create_database_query)

Error: "1007 (HY000): Can't create database 'mysql_python'; database exists"

In [29]:
# Connect to database

def create_db_connection(host_name, username, user_pw, database_name):
    connection = None
    try:
        connection = mysql.connector.connect(
            host = host_name,
            user = username,
            password = user_pw,
            database = database_name
        )
        print('MySQL database connection successfull')
    except Error as err:
        print(f'Error: "{err}"')
    return connection

In [26]:
# Execute SQL queries
def execute_query(connection, query):
    cursor = connection.cursor()
    try:
        cursor.execute(query)
        connection.commit()
        print('Query was successful')
    except Error as err:
        print(f'Error: {err}')

In [31]:
create_orders_table = """
create table orders (
Order_ID int primary key,
Customer_Name varchar(50) not null,
Product_Name varchar(50) not null,
Date_ordered date,
Quantity int,
Unit_price float,
Phone_no varchar(20)
);
"""

# Connect to database
connection = create_db_connection('localhost', 'root', pw, db)
execute_query(connection, create_orders_table)

MySQL database connection successfull
Query was successful

In [33]:
# Insert Data

data_orders = """
insert into orders values
(101, 'Steve', 'Laptop', '2018-06-12', 2, 800, 6293730802),
(102, 'Sarah', 'Tablet', '2019-03-25', 3, 600, 7284910021),
(103, 'David', 'Smartphone', '2020-08-10', 1, 1000, 5248763098),
(104, 'Emily', 'Desktop', '2017-12-05', 2, 1200, 4157289640),
(105, 'Amit', 'Laptop', '2021-02-15', 4, 900, 3628150497),
(106, 'Neha', 'Tablet', '2018-09-30', 3, 650, 9267103845);
"""

connection = create_db_connection('localhost', 'root', pw, db)
execute_query(connection, data_orders)

MySQL database connection successfull
Query was successful

In [34]:
def read_query(connection, query):
    cursor = connection.cursor()
    result = None
    try:
        cursor.execute(query)
        result = cursor.fetchall()
        return result
    except Error as err:
        print(f'Error: "{err}"')

In [41]:
# Using select statement
q1 = '''
select * from orders;
'''
connection = create_db_connection('localhost', 'root', pw, db)
results = read_query(connection, q1)
for result in results:
    print(result)

MySQL database connection successfull
(101, 'Steve', 'Laptop', datetime.date(2018, 6, 12), 2, 800.0, '6293730802')
(102, 'Sarah', 'Tablet', datetime.date(2019, 3, 25), 3, 600.0, '7284910021')
(103, 'David', 'Smartphone', datetime.date(2020, 8, 10), 1, 1000.0, '5248763098')
(104, 'Emily', 'Desktop', datetime.date(2017, 12, 5), 2, 1200.0, '4157289640')
(105, 'Amit', 'Laptop', datetime.date(2021, 2, 15), 4, 900.0, '3628150497')
(106, 'Neha', 'Tablet', datetime.date(2018, 9, 30), 3, 650.0, '9267103845')

In [36]:
q2 = '''
select customer_name, Phone_no from orders;
'''
connection = create_db_connection('localhost', 'root', pw, db)
results = read_query(connection, q2)
for result in results:
    print(result)

MySQL database connection successfull
('Steve', '6293730802')
('Sarah', '7284910021')
('David', '5248763098')
('Emily', '4157289640')
('Amit', '3628150497')
('Neha', '9267103845')

In [38]:
q3 = '''
select year(date_ordered) from orders;
'''
connection = create_db_connection('localhost', 'root', pw, db)
results = read_query(connection, q3)
for result in results:
    print(result)

MySQL database connection successfull
(2018,)
(2019,)
(2020,)
(2017,)
(2021,)
(2018,)

In [39]:
q4 = '''
select distinct year(date_ordered) from orders;
'''
connection = create_db_connection('localhost', 'root', pw, db)
results = read_query(connection, q4)
for result in results:
    print(result)

MySQL database connection successfull
(2018,)
(2019,)
(2020,)
(2017,)
(2021,)

In [43]:
# Using select statement
q1 = '''
select * from orders;
'''
connection = create_db_connection('localhost', 'root', pw, db)
results = read_query(connection, q1)
for result in results:
    print(result)

MySQL database connection successfull
(101, 'Steve', 'Laptop', datetime.date(2018, 6, 12), 2, 800.0, '6293730802')
(102, 'Sarah', 'Tablet', datetime.date(2019, 3, 25), 3, 600.0, '7284910021')
(103, 'David', 'Smartphone', datetime.date(2020, 8, 10), 1, 1000.0, '5248763098')
(104, 'Emily', 'Desktop', datetime.date(2017, 12, 5), 2, 1200.0, '4157289640')
(105, 'Amit', 'Laptop', datetime.date(2021, 2, 15), 4, 900.0, '3628150497')
(106, 'Neha', 'Tablet', datetime.date(2018, 9, 30), 3, 650.0, '9267103845')

In [46]:
from_db = []
for result in results:
    result = list(result)
    from_db.append(result)
columns = ['order_id', 'customer_name', 'product_name', 'date_ordered',
          'quantity', 'unit_price', 'phone_no']
df = pd.DataFrame(from_db, columns = columns)
display(df)

,order_id,customer_name,product_name,date_ordered,quantity,unit_price,phone_no
0,101,Steve,Laptop,2018-06-12,2,800.0,6293730802
1,102,Sarah,Tablet,2019-03-25,3,600.0,7284910021
2,103,David,Smartphone,2020-08-10,1,1000.0,5248763098
3,104,Emily,Desktop,2017-12-05,2,1200.0,4157289640
4,105,Amit,Laptop,2021-02-15,4,900.0,3628150497
5,106,Neha,Tablet,2018-09-30,3,650.0,9267103845

In [48]:
# Update Command
update = '''
update orders
set unit_price = 1100
where order_id = 104;
'''
connection = create_db_connection('localhost', 'root', pw, db)
execute_query(connection, update)

MySQL database connection successfull
Query was successful

In [49]:
q1 = '''
select * from orders;
'''
connection = create_db_connection('localhost', 'root', pw, db)
results = read_query(connection, q1)
for result in results:
    print(result)

MySQL database connection successfull
(101, 'Steve', 'Laptop', datetime.date(2018, 6, 12), 2, 800.0, '6293730802')
(102, 'Sarah', 'Tablet', datetime.date(2019, 3, 25), 3, 600.0, '7284910021')
(103, 'David', 'Smartphone', datetime.date(2020, 8, 10), 1, 1000.0, '5248763098')
(104, 'Emily', 'Desktop', datetime.date(2017, 12, 5), 2, 1100.0, '4157289640')
(105, 'Amit', 'Laptop', datetime.date(2021, 2, 15), 4, 900.0, '3628150497')
(106, 'Neha', 'Tablet', datetime.date(2018, 9, 30), 3, 650.0, '9267103845')

In [50]:
# Delete command
delete = '''
delete from orders
where order_id = 105;
'''

connection = create_db_connection('localhost', 'root', pw, db)
execute_query(connection, delete)

MySQL database connection successfull
Query was successful

In [51]:
q1 = '''
select * from orders;
'''
connection = create_db_connection('localhost', 'root', pw, db)
results = read_query(connection, q1)
for result in results:
    print(result)

MySQL database connection successfull
(101, 'Steve', 'Laptop', datetime.date(2018, 6, 12), 2, 800.0, '6293730802')
(102, 'Sarah', 'Tablet', datetime.date(2019, 3, 25), 3, 600.0, '7284910021')
(103, 'David', 'Smartphone', datetime.date(2020, 8, 10), 1, 1000.0, '5248763098')
(104, 'Emily', 'Desktop', datetime.date(2017, 12, 5), 2, 1100.0, '4157289640')
(106, 'Neha', 'Tablet', datetime.date(2018, 9, 30), 3, 650.0, '9267103845')